In [2]:
import pandas as pd

In [14]:
d=pd.read_csv("C:\\Users\\y20cs170\\Desktop\\cs.csv")

In [15]:
df=pd.DataFrame(d)

In [16]:
df

        name  rollno  n1  n2  n3
0  sravanthi     170  90  89  93
1    keerthi     142  89  95  97
2      divya     186  94  93  95
3       sufi     800  89  87  99

In [31]:
df['sum']=df['n1']+df['n2']+df['n3']
df

        name  rollno  n1  n2  n3  sum        per grade  (0, 2)
0  sravanthi     170  90  89  93  272  90.666667     a      70
1    keerthi     142  89  95  97  281  93.666667     a      70
2      divya     186  94  93  95  282  94.000000     a      70
3       sufi     800  89  87  99  275  91.666667     a      70

In [37]:
df=df.drop(columns=[(0,2)])

In [41]:
df['per']=(df['sum']/300)*100
df

        name  rollno  n1  n2  n3  sum        per grade
0  sravanthi     170  90  89  93  272  90.666667     a
1    keerthi     142  89  95  97  281  93.666667     a
2      divya     186  94  93  95  282  94.000000     a
3       sufi     800  89  87  99  275  91.666667     a

In [42]:
df

        name  rollno  n1  n2  n3  sum        per grade
0  sravanthi     170  90  89  93  272  90.666667     a
1    keerthi     142  89  95  97  281  93.666667     a
2      divya     186  94  93  95  282  94.000000     a
3       sufi     800  89  87  99  275  91.666667     a

In [43]:
def grade(var):
    if var>=90:
        return 'a'
    elif var>=80:
        return 'b'
    else:
        return 'c'
for i in range (4):
    v=df.iat[i,6]
    df.iat[i,7]=grade(v)

In [44]:
df

        name  rollno  n1  n2  n3  sum        per grade
0  sravanthi     170  90  89  93  272  90.666667     a
1    keerthi     142  89  95  97  281  93.666667     a
2      divya     186  94  93  95  282  94.000000     a
3       sufi     800  89  87  99  275  91.666667     a

In [48]:
df.to_csv(r'C:\\Users\\y20cs170\\Desktop\\cs.csv')